#整型和c一样
#长整型最后带L
#浮点型和c一样
#复数用j表示
#布尔型:True,False
#字符型:单引号,双引号,三引号


#python会内存自动释放,当引用索引为0时会自动释放,不用考虑内存释放问题
a=1
b=1111111111111111111111111111111111111111111111231222222222222222222222222222221
c=1.5
d=1+4j
e=False
f='python'
print(type(a))
print(type(b))
print(type(c))
print(type(d))
print(type(e))
print(type(f))

#python会定义一个常用的整数池,类似c的常量区,值相同那么id相同
a1=255
a2=255
a12=0
a13=254
print("id255=",id(a1))
print("id255=",id(a2))
print("id0=",id(a12))
print("id254=",id(a13))
#非常用的数需要另外开辟空间
a3=-1
a4=100000000000000000000000000000000000000000000000000000000
a5=100000000000000000000000000000000000000000000000000000000
print("id-1=",id(a3))
print("id9000=",id(a4))
print("id9000=",id(a5))
